Autodesk.Revit.DB.SupressJournalingTransactions.ResumeJournaling
Resume journaling of transactions.
Since:
2026

Autodesk.Revit.DB.SupressJournalingTransactions.StopJournaling
Stop journaling transactions.
Since:
2026

Autodesk.Revit.DB.SupressJournalingTransactions
This class is used to suppress journaling of transactions.
Used for journaling of async code that submits transactions (like DynamoPlayer)
Since:
2026